samples/SOAP XML/IOS+/BookingGetByOrganization2_request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <BookingGetByOrganization2 xmlns="http://webservices.iress.com.au/v4/">
      <Input>
        <Header>
          <ServiceSessionKey>BABC42E7-9756-4E31-8EBE-C2F2915F9EED@IDS-TEST</ServiceSessionKey>
          <RequestID>8A2452BF-18B3-44F0-B7FA-D649E7BC5F90</RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <OrganizationArray>
            <Organization>IRESS</Organization>
          </OrganizationArray>
          <IncludeDeleted>false</IncludeDeleted>
          <FromAsAtDate xsi:nil="true" />
          <ToAsAtDate xsi:nil="true" />
          <FromTradeDate>2020-10-26</FromTradeDate>
          <ToTradeDate>2020-10-28</ToTradeDate>
          <FromCreateDateTime xsi:nil="true" />
          <ToCreateDateTime xsi:nil="true" />
          <FromUpdateDateTime xsi:nil="true" />
          <ToUpdateDateTime xsi:nil="true" />
          <GroupingTag xsi:nil="true" />
          <ExcludeMatched>false</ExcludeMatched>
          <SecurityCode xsi:nil="true" />
          <Exchange xsi:nil="true" />
          <BuyOrSell xsi:nil="true" />
          <OrderNumberArray xsi:nil="true" />
          <BulkAllocationID xsi:nil="true" />
        </Parameters>
      </Input>
    </BookingGetByOrganization2>
  </soap:Body>
</soap:Envelope>